ArtilleryTesting/test.yaml
config:
  target: 'http://localhost:8001'
  phases:
  - duration: 10
    arrivalRate: 10
scenarios:
- flow:
  - get:
      # add the url you need to send get request
      url: "/api/products"
      capture:
      # capturing responce using reg expression
      - regexp: "[^]*"
        as: "response"
#  - log: "response= {{response}}"